#pragma once
//Завдання №1
//Реалізуйте клас стеку для роботи з символами(символьний стек).Стек повинен мати фіксований розмір.Також
//реалізуйте набір операцій для роботи зі стеком : внесення
//символу в стек, видалення символу зі стеку, підрахунок
//кількості символів в стеці, перевірку, чи стек порожній,
//перевірку, чи стек повний, очищення стеку, отримання
//без видалення верхнього символу в стеці.
//Завдання №2
//Змініть стек з першого завдання зі статичного типу на
//динамічний(за нестачі вільного місця потрібно змінити
//	розмір внутрішнього масиву без втрати даних).
class MyStack
{
	char* _stack;
	int _empty;
	int _full;
	int _top;
	int _items;
public:
	MyStack();
	MyStack(int);
	~MyStack();
	void add(char);
	char get();
	int howManyChar();
	bool isFull();
	bool isEmpty();
	void clear();
	char lastIn();
	void changeVolume(int);
};

